Autodesk.Revit.DB.LevelTypeSet
A set that contains level types.

Autodesk.Revit.DB.LevelTypeSet.Insert(Autodesk.Revit.DB.LevelType)
System.Int32
Insert the specified level type into the set.
item: The level type to be inserted into the set.
Returns: Returns whether the level type was inserted into the set.

Autodesk.Revit.DB.LevelTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.LevelTypeSet.ReverseIterator
Autodesk.Revit.DB.LevelTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.LevelTypeSet.ForwardIterator
Autodesk.Revit.DB.LevelTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.LevelTypeSet.Erase(Autodesk.Revit.DB.LevelType)
System.Int32
Removes a specified level type from the set.
item: The level type to be erased.
Returns: The number of level types that were erased from the set.

Autodesk.Revit.DB.LevelTypeSet.Contains(Autodesk.Revit.DB.LevelType)
System.Boolean
Tests for the existence of a level type within the set.
item: The level type to be searched for.
Returns: The Contains method returns True if the level type is within the set, otherwise False.

Autodesk.Revit.DB.LevelTypeSet.Clear
void
Removes every level type from the set, rendering it empty.

Autodesk.Revit.DB.LevelTypeSet.Size
System.Int32
get
Returns the number of level types that are in the set.

Autodesk.Revit.DB.LevelTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.